Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCurtainPanelInOpeningCorruption Property
 Can't create Curtain Panel in opening. The opening is probably too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCurtainPanelInOpeningCorruption { get; }
Public Shared ReadOnly Property CannotCreateCurtainPanelInOpeningCorruption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCurtainPanelInOpeningCorruption {
	FailureDefinitionId^ get ();
}
static member CannotCreateCurtainPanelInOpeningCorruption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace